In [25]:
from pymongo import MongoClient

In [26]:
import pymongo

In [27]:
client = MongoClient(
    host = 'localhost',
    port = 27017 #몽고의 기본 포트번호
)

In [28]:
client.list_database_names()

['admin', 'config', 'local', 'ubion']

In [29]:
db = client["ubion"]
list(db.test.find())


#SELECT * FROM test

TypeError: 'dict' object is not callable

In [ ]:
list(db["test"].find())

[{'_id': ObjectId('62328e822b7ef9a10d61af54'),
  'name': 'test',
  'phone': '0101232133'},
 {'_id': ObjectId('623290ca2b7ef9a10d61af56'), 'loc': 'Seoul'},
 {'_id': ObjectId('623290ca2b7ef9a10d61af57'), 'gender': 'male', 'age': 20.0},
 {'_id': ObjectId('623291a12b7ef9a10d61af58'), 'name': 'test2', 'age': 30.0},
 {'_id': ObjectId('6232a29ced174bdb776152ef')},
 {'_id': ObjectId('6232a2b8ed174bdb776152f0'), '1': '2'},
 {'_id': ObjectId('6232a2b8ed174bdb776152f1'), '3': '4'}]

In [ ]:
data = {
        "1" : "1",
        "2" : "2",
        "3" : "3"
}

db.test.insert_one({})
#INSERT INTO test VALUE ()

In [ ]:
# data 변수 만들어서 insert_many 사용 할것

In [ ]:
data = [{ #리스트 안에 딕셔너리 형태로 넣어야 MANY
        "1" : "2"
},
{
        "3" : "4"
        
}]

db.test.insert_many(data)

In [ ]:
db.list_collection_names()

In [ ]:
list(db.test.find())

[{'_id': ObjectId('62328e822b7ef9a10d61af54'),
  'name': 'test',
  'phone': '0101232133'},
 {'_id': ObjectId('623290ca2b7ef9a10d61af56'), 'loc': 'Seoul'},
 {'_id': ObjectId('623290ca2b7ef9a10d61af57'), 'gender': 'male', 'age': 20.0},
 {'_id': ObjectId('623291a12b7ef9a10d61af58'), 'name': 'test2', 'age': 30.0},
 {'_id': ObjectId('6232a29ced174bdb776152ef')},
 {'_id': ObjectId('6232a2b8ed174bdb776152f0'), '1': '2'},
 {'_id': ObjectId('6232a2b8ed174bdb776152f1'), '3': '4'},
 {'_id': ObjectId('6232be3db70508c228388bb3')},
 {'_id': ObjectId('6232be3db70508c228388bb4'), '1': '2'},
 {'_id': ObjectId('6232be3db70508c228388bb5'), '3': '4'}]

In [ ]:
import mod_sql
import pandas as pd

In [ ]:
_db = mod_sql.Database()

In [ ]:
sql = """
      SELECT EMPNO
      FROM emp   
        """
result = _db.executeAll(sql)
pd.DataFrame(result)

   EMPNO
0   7782
1   7839
2   7934
3   7369
4   7566
5   7788
6   7876
7   7902
8   7499
9   7521
10  7654
11  7698
12  7844
13  7900

In [ ]:
db.emp.insert_many(result)

InvalidDocument: cannot encode object: Decimal('7782'), of type: <class 'decimal.Decimal'>

In [ ]:
db.emp.find_one()

In [ ]:
list(db.emp.find(
    {
        "ENAME" : "SMITH"
    }
)) #대소문자가 확실히 구분됨
#SELECT * FROM emp WHERE ENAME = "SMITH"

TypeError: 'dict' object is not callable

In [ ]:
db.emp.find(
    {
        "ENAME" : "SMITH"
    }
) #파이몽고의

In [ ]:
type(db.emp.find())

pymongo.cursor.Cursor

In [ ]:
result = db.emp.find()

for list in result:
    print(list)

{'_id': ObjectId('6232b725f2ada82ce58d0ef2'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef3'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef4'), 'EMPNO': '7521', 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-22', 'SAL': '1250.00', 'COMM': '500.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef5'), 'EMPNO': '7566', 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-04-02', 'SAL': '2975.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef6'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-28', 'SAL': '1250.00', 'COMM': '1400.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef7'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-05-01', 'SAL': '2850.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef8'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-06-09', 'SAL': '2450.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef9'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1987-06-28', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0efa'), 'EMPNO': '7839', 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': '5000.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b725f2ada82ce58d0efb'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-08', 'SAL': '1500.00', 'COMM': '0.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0efc'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0efd'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0efe'), 'EMPNO': '7902', 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1981-12-03', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0eff'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}

In [ ]:
## emp collection 
## key 값이 EMPNO, ENAME, DEPTNO만 출력이 되도록 코드를 작성

In [ ]:
list(db.emp.find(
    {},                 #where 절(첫번째 중가로 의미)
    {"EMPNO" : 1,                   #column 절(두번째 중가로 의미)
     "ENAME" : 1,
     "DEPTNO" : 1}
))

TypeError: 'dict' object is not callable

In [ ]:
result = db.emp.find(
    {},                 #where 절(첫번째 중가로 의미)
    {"EMPNO" : 1,                   #column 절(두번째 중가로 의미)
     "ENAME" : 1,
     "DEPTNO" : 1}
)
for list in result:
    print(list)

{'_id': ObjectId('6232b725f2ada82ce58d0ef2'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef3'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef4'), 'EMPNO': '7521', 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef5'), 'EMPNO': '7566', 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef6'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef7'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef8'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b725f2ada82ce58d0ef9'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0efa'), 'EMPNO': '7839', 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b725f2ada82ce58d0efb'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0efc'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0efd'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b725f2ada82ce58d0efe'), 'EMPNO': '7902', 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b725f2ada82ce58d0eff'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [ ]:
import pprint

In [ ]:
result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

{'DEPTNO': '20',
 'EMPNO': '7876',
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': '7788',
 'SAL': '1100.00',
 '_id': ObjectId('6232b725f2ada82ce58d0efc')}
{'COMM': '300.00',
 'DEPTNO': '30',
 'EMPNO': '7499',
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1600.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef3')}
{'DEPTNO': '30',
 'EMPNO': '7698',
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2850.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef7')}
{'DEPTNO': '10',
 'EMPNO': '7782',
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2450.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef8')}
{'DEPTNO': '20',
 'EMPNO': '7902',
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b725f2ada82ce58d0efe')}
{'DEPTNO': '30',
 'EMPNO': '7900',
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': '7698',
 'SAL': '950.00',
 '_id': ObjectId('6232b725f2ada82ce58d0efd')}
{'DEPTNO': '20',
 'EMPNO': '7566',
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2975.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef5')}
{'DEPTNO': '10',
 'EMPNO': '7839',
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': '5000.00',
 '_id': ObjectId('6232b725f2ada82ce58d0efa')}
{'COMM': '1400.00',
 'DEPTNO': '30',
 'EMPNO': '7654',
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef6')}
{'DEPTNO': '10',
 'EMPNO': '7934',
 'ENAME': 'MILLER',
 'HIREDATE': '1982-01-23',
 'JOB': 'CLERK',
 'MGR': '7782',
 'SAL': '1300.00',
 '_id': ObjectId('6232b725f2ada82ce58d0eff')}
{'DEPTNO': '20',
 'EMPNO': '7788',
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef9')}
{'DEPTNO': '20',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': '7902',
 'SAL': '800.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef2')}
{'COMM': '0.00',
 'DEPTNO': '30',
 'EMPNO': '7844',
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1500.00',
 '_id': ObjectId('6232b725f2ada82ce58d0efb')}
{'COMM': '500.00',
 'DEPTNO': '30',
 'EMPNO': '7521',
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b725f2ada82ce58d0ef4')}

In [31]:
result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

# SELECT * FROM emp ORDER BY ENAME

{'DEPTNO': 20,
 'EMPNO': 7876,
 'ENAME': 'ADAMS',
 'HIREDATE': 1987,
 'JOB': 'CLERK',
 'MGR': 7788,
 'SAL': 1100.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0c')}
{'COMM': 300,
 'DEPTNO': 30,
 'EMPNO': 7499,
 'ENAME': 'ALLEN',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1600.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f03')}
{'DEPTNO': 30,
 'EMPNO': 7698,
 'ENAME': 'BLAKE',
 'HIREDATE': 1981,
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2850.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f07')}
{'DEPTNO': 10,
 'EMPNO': 7782,
 'ENAME': 'CLARK',
 'HIREDATE': 1981,
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2450.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f08')}
{'DEPTNO': 20,
 'EMPNO': 7902,
 'ENAME': 'FORD',
 'HIREDATE': 1981,
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0e')}
{'DEPTNO': 30,
 'EMPNO': 7900,
 'ENAME': 'JAMES',
 'HIREDATE': 1981,
 'JOB': 'CLERK',
 'MGR': 7698,
 'SAL': 950.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0d')}
{'DEPTNO': 20,
 'EMPNO': 7566,
 'ENAME': 'JONES',
 'HIREDATE': 1981,
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2975.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f05')}
{'DEPTNO': 10,
 'EMPNO': 7839,
 'ENAME': 'KING',
 'HIREDATE': 1981,
 'JOB': 'PRESIDENT',
 'SAL': 5000.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0a')}
{'COMM': 1400,
 'DEPTNO': 30,
 'EMPNO': 7654,
 'ENAME': 'MARTIN',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f06')}
{'DEPTNO': 10,
 'EMPNO': 7934,
 'ENAME': 'MILLER',
 'HIREDATE': 1982,
 'JOB': 'CLERK',
 'MGR': 7782,
 'SAL': 1300.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0f')}
{'DEPTNO': 20,
 'EMPNO': 7788,
 'ENAME': 'SCOTT',
 'HIREDATE': 1987,
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f09')}
{'DEPTNO': 20,
 'EMPNO': 7369,
 'ENAME': 'SMITH',
 'HIREDATE': 1980,
 'JOB': 'CLERK',
 'MGR': 7902,
 'SAL': 800.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f02')}
{'COMM': 0,
 'DEPTNO': 30,
 'EMPNO': 7844,
 'ENAME': 'TURNER',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1500.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0b')}
{'COMM': 500,
 'DEPTNO': 30,
 'EMPNO': 7521,
 'ENAME': 'WARD',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f04')}

In [38]:
#급여가 2000보다 크거나 같은 데이터만 출력
result = db.emp.find(
    {
        "SAL" : {
            "$gte": 2450
        }
    }
))
for list in result:
    pprint.pprint(list)

# SELECT * FROM WHERE SAL >= 2000

SyntaxError: unmatched ')' (3227398421.py, line 8)

In [40]:
#급여가 2000보다 작은 데이터만 출력
result = db.emp.find(
    {
        "SAL" : {
            "$lt": 2450
        }
    }
)
for list in result:
    pprint.pprint(list)

# SELECT * FROM WHERE SAL < 2000

{'DEPTNO': 20,
 'EMPNO': 7369,
 'ENAME': 'SMITH',
 'HIREDATE': 1980,
 'JOB': 'CLERK',
 'MGR': 7902,
 'SAL': 800.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f02')}
{'COMM': 300,
 'DEPTNO': 30,
 'EMPNO': 7499,
 'ENAME': 'ALLEN',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1600.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f03')}
{'COMM': 500,
 'DEPTNO': 30,
 'EMPNO': 7521,
 'ENAME': 'WARD',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f04')}
{'COMM': 1400,
 'DEPTNO': 30,
 'EMPNO': 7654,
 'ENAME': 'MARTIN',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f06')}
{'COMM': 0,
 'DEPTNO': 30,
 'EMPNO': 7844,
 'ENAME': 'TURNER',
 'HIREDATE': 1981,
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1500.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0b')}
{'DEPTNO': 20,
 'EMPNO': 7876,
 'ENAME': 'ADAMS',
 'HIREDATE': 1987,
 'JOB': 'CLERK',
 'MGR': 7788,
 'SAL': 1100.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0c')}
{'DEPTNO': 30,
 'EMPNO': 7900,
 'ENAME': 'JAMES',
 'HIREDATE': 1981,
 'JOB': 'CLERK',
 'MGR': 7698,
 'SAL': 950.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0d')}
{'DEPTNO': 10,
 'EMPNO': 7934,
 'ENAME': 'MILLER',
 'HIREDATE': 1982,
 'JOB': 'CLERK',
 'MGR': 7782,
 'SAL': 1300.0,
 '_id': ObjectId('6232c6ddf2ada82ce58d0f0f')}

In [44]:
#SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN
result = db.emp.find(
    {
        "$or" : [
            {
            "ENAME": "SMITH"
        },
        {
            "ENAME" : "ALLEN"
        }
        ]
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232c6ddf2ada82ce58d0f02'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': 1980, 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6ddf2ada82ce58d0f03'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': 1981, 'SAL': 1600.0, 'COMM': 300, 'DEPTNO': 30}

In [42]:
#SELECT * FROM emp WHERE ENAME = SMITH AND JOB = CLERK
result = db.emp.find(
    {
        "ENAME" : "SMITH",
        "JOB" : "CLERK"
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232c6ddf2ada82ce58d0f02'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': 1980, 'SAL': 800.0, 'DEPTNO': 20}

In [47]:
#SELECT * FROM emp WHERE SAL >= 2000 AND SAL < 4000
result = db.emp.find(
    {
        "SAL" : {
            "$gte" : 2000,
            "$lt" : 4000
        }
    }, {
        "_id" : 0
    }
)

pd.DataFrame(result)

   EMPNO  ENAME      JOB   MGR  HIREDATE     SAL  DEPTNO
0   7566  JONES  MANAGER  7839      1981  2975.0      20
1   7698  BLAKE  MANAGER  7839      1981  2850.0      30
2   7782  CLARK  MANAGER  7839      1981  2450.0      10
3   7788  SCOTT  ANALYST  7566      1987  3000.0      20
4   7902   FORD  ANALYST  7566      1981  3000.0      20

In [53]:
#SELECT * FROM emp WHERE ENAME LIKE S%

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "^S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232c6ddf2ada82ce58d0f02,7369,SMITH,CLERK,7902,1980,800.0,20
1,6232c6ddf2ada82ce58d0f09,7788,SCOTT,ANALYST,7566,1987,3000.0,20

In [55]:
#SELECT * FROM emp WHERE ENAME LIKE %S%

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232c6ddf2ada82ce58d0f02,7369,SMITH,CLERK,7902,1980,800.0,20
1,6232c6ddf2ada82ce58d0f05,7566,JONES,MANAGER,7839,1981,2975.0,20
2,6232c6ddf2ada82ce58d0f09,7788,SCOTT,ANALYST,7566,1987,3000.0,20
3,6232c6ddf2ada82ce58d0f0c,7876,ADAMS,CLERK,7788,1987,1100.0,20
4,6232c6ddf2ada82ce58d0f0d,7900,JAMES,CLERK,7698,1981,950.0,30

In [56]:
#SELECT * FROM emp WHERE ENAME LIKE %S

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S$"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232c6ddf2ada82ce58d0f05,7566,JONES,MANAGER,7839,1981,2975.0,20
1,6232c6ddf2ada82ce58d0f0c,7876,ADAMS,CLERK,7788,1987,1100.0,20
2,6232c6ddf2ada82ce58d0f0d,7900,JAMES,CLERK,7698,1981,950.0,30

In [68]:
# SELECT ENAME, JOB, SAL, DEPTNO 
# FROM emp WHERE SAL > 1250 AND SAL <= 3000 
# AND JOB = SALESMAN ORDER BY ENAME

result = db.emp.find(
    {
        "SAL" : {
            "$gt" : 1250,
            "$lte" : 3000
        }, "JOB" : "SALESMAN"
    }, {"JOB" : 1,                 #where 절(첫번째 중가로 의미)                 
        "ENAME" : 1,               #column 절(두번째 중가로 의미 )
        "DEPTNO" : 1,
        "SAL" : 1, 
        "_id" :0 
        }
).sort("ENAME", -1)
pd.DataFrame(result)

    ENAME       JOB     SAL  DEPTNO
0  TURNER  SALESMAN  1500.0      30
1   ALLEN  SALESMAN  1600.0      30